import styles from './polityka-konfidentsiynosti.module.css'

export default function Oferta() {
  return (
    <section className={styles.privacyPolicy}>
        <h1>Політика конфіденційності</h1>

        <p>
            Цей документ визначає політику конфіденційності сайту Виконавця відповідно
            до Закону України «Про захист персональних даних».
        </p>

        <h2>1. Загальні положення</h2>
        <p><strong>1.1.</strong> Виконавець зобов’язується захищати конфіденційність і безпеку персональних даних користувачів.</p>
        <p><strong>1.2.</strong> Політика поширюється на всі дані, які Замовник надає через сайт.</p>

        <h2>2. Обробка персональних даних</h2>
        <p><strong>2.1.</strong> Персональні дані збираються виключно для надання послуг, зворотного зв'язку та ведення бухгалтерської документації.</p>
        <p><strong>2.2.</strong> Виконавець може обробляти наступні дані: ім’я, контактний номер, електронна пошта, інформація про консультації.</p>

        <h2>3. Зберігання та захист даних</h2>
        <p><strong>3.1.</strong> Персональні дані зберігаються в захищених базах даних протягом терміну, необхідного для виконання послуг.</p>
        <p><strong>3.2.</strong> Виконавець вживає всіх необхідних заходів для захисту даних від несанкціонованого доступу.</p>

        <h2>4. Права користувачів</h2>
        <p><strong>4.1.</strong> Замовник має право на доступ до своїх даних, їх виправлення або видалення.</p>
        <p><strong>4.2.</strong> Для реалізації цих прав необхідно звернутися до Виконавця за контактними даними, вказаними на сайті.</p>

        <h2>5. Передача даних третім особам</h2>
        <p><strong>5.1.</strong> Виконавець не передає персональні дані третім особам без згоди користувача, за винятком випадків, передбачених законодавством.</p>

        <h2>6. Зміни політики конфіденційності</h2>
        <p><strong>6.1.</strong> Виконавець залишає за собою право змінювати цю Політику з розміщенням нової редакції на сайті.</p>

        <h2>7. Контактна інформація</h2>
        <p><strong>ФОП Комарвоа Ірина Володимирівна</strong></p>
        {/* <p>
            Сайт:
            <a href="https://ira-ustymenko-psy.com.ua" target="_blank" rel="noopener noreferrer">
            ira-ustymenko-psy.com.ua
            </a>
        </p> */}
        <p>Дата публікації: 01.01.2026</p>
    </section>

  )
}